{"_id":{"$oid":"65265dc1fd6624ad8155ec95"},"Title":"Saving Privete Rayan","Description":"Following the Normandy landings, a group of U.S. soldiers go behind enemy lines to retrieve a paratrooper whose brothers have been killed in action at cost of their lives.","Genres":{"Name":"War","Description":"War film is a film genre concerned with warfare, typically about naval, air, or land battles, with combat scenes central to the drama"},"Year":"1998","Director":{"Name":"Steven Spielberg","Bio":"One of the most influencial personalities in the history of cinema, Steven Sielberg is Hollywood's best known director and one of the wealthiest filmmakers in the world.","Birthyear":{"$date":"1970-01-01T00:00:00Z"}},"ImageURL":"https://www.imdb.com/title/tto120815/mediaviewer/rm1924732160/?ref_=tt_ov_i","Featured":"False","Bio":"One of the most influencial personalities in the history of cinema, Steven Sielberg is Hollywood's best known director and one of the wealthiest filmmakers in the world. He secured multiple academy awards throughout his career"}
{"_id":{"$oid":"6526ab99fd6624ad8155ec96"},"Title":"The Shawshank Redemption","Description":"Over the course of several years, two convicts form a friendship, seeking consolation and, eventually, redemption through basic compassion.","Genres":{"Name":"Drama","Description":"In film and television, drama is a category or genre of narrative fiction (or semi-fiction) intended to be more serious than humorous in tone."},"Year":"1994","Director":{"Name":"Frank Darabont","Bio":"Three-time Oscar nominee Frank Darabont was born in a refugee camp in 1959 in Montbeliard, France, the son of Hungarian parents who had fled Budapest during the failed 1956 Hungarian revolution. Brought to America as an infant, he settled with his family in Los Angeles and attended Hollywood High School. His first job in movies was as a production assistant on the 1981 low-budget film","Birthyear":{"$date":{"$numberLong":"-336614400000"}}},"ImageURL":"https://www.imdb.com/title/tt0111161/mediaviewer/rm1690056449/?ref_=tt_ov_i","Stars":"Tim Robbins, Morgan Freeman, Bob Gunton","Featured":" False"}
{"_id":{"$oid":"6526b841fd6624ad8155ec97"},"Title":"Forrest Gump","Description":"The history of the United States from the 1950s to the '70s unfolds from the perspective of an Alabama man with an IQ of 75, who yearns to be reunited with his childhood sweetheart.","Year":"1994","Director":{"Name":"Robert Zemeckis","Bio":"A whiz-kid with special effects, Robert is from the Spielberg camp of film-making (Steven Spielberg produced many of his films). Usually working with writing partner Bob Gale, Robert's earlier films show he has a talent for zany comedy (Romancing the Stone (1984), 1941 (1979)) and special effect vehicles (Who Framed Roger Rabbit (1988) and Back to the Future (1985)). His later films have become more serious, with the hugely successful Tom Hanks vehicle Forrest Gump (1994) and the Jodie Foster film Contact (1997), both critically acclaimed movies. Again, these films incorporate stunning effects. Robert has proved he can work a serious story around great effects.","Birthyear":{"$date":"1970-07-02T00:00:00Z"}},"ImageURL":"https://www.imdb.com/title/tt0109830/mediaviewer/rm1954748672/?ref_=tt_ov_i","Stars":"Tom Hanks, Robin Wright, Gary Sinise","Featured":"False","Genres":{"Name":"Romance","Description":"Romance films involve romantic love stories recorded in visual media for broadcast in theatres or on television that focus on passion, emotion, and the affectionate romantic involvement of the main characters. Typically their journey through dating."}}
{"_id":{"$oid":"6526bcb0fd6624ad8155ec98"},"Title":"The Dark knight","Description":"When the menace known as the Joker wreaks havoc and chaos on the people of Gotham, Batman must accept one of the greatest psychological and physical tests of his ability to fight injustice.","Year":"1994","Director":{"Name":"Christopher Nolan","Bio":"Christopher Edward Nolan CBE is a British and American filmmaker. Known for his Hollywood blockbusters with complex storytelling, Nolan is considered a leading filmmaker of the 21st century.","Birthyear":{"$date":"1970-07-30T00:00:00Z"}},"ImageURL":"https://www.imdb.com/title/tt0468569/mediaviewer/rm4023877632/?ref_=tt_ov_i","Stars":"Christian Bale, Heath Ledger, Aaron Eckhart","Featured":"True","Genres":{"Name":"Action","Description":"Action film is a film genre in which the protagonist is thrust into a series of events that typically involve violence and physical feats."}}
{"_id":{"$oid":"6526bee7fd6624ad8155ec99"},"Title":"Schindler's List","Description":"In German-occupied Poland during World War II, industrialist Oskar Schindler gradually becomes concerned for his Jewish workforce after witnessing their persecution by the Nazis.","Year":"1993","Director":{"Name":"Steven Spielberg","Bio":"One of the most influential personalities in the history of cinema, Steven Spielberg is Hollywood's best known director and one of the wealthiest filmmakers in the world.","Birthyear":{"$date":{"$numberLong":"-336614400000"}}},"ImageURL":"https://www.imdb.com/title/tt0108052/mediaviewer/rm1610023168/?ref_=tt_ov_i","Stars":"Liam Neeson, Ralph Fiennes, Ben Kingsley","Featured":"False","Genres":{"Name":"Biography","Description":"A biography is a nonfiction account of a real person's life written by someone else. Biographies may offer detailed accounts on people's lives, specific important experiences, the historical impact of someone, and more."}}
{"_id":{"$oid":"6526c062fd6624ad8155ec9a"},"Title":"The Green Mile","Description":"A tale set on death row in a Southern jail, where gentle giant John possesses the mysterious power to heal people's ailments. When the lead guard, Paul, recognizes John's gift, he tries to help stave off the condemned man's execution.","Year":"1999","Director":{"Name":"Frank Darabont","Bio":"Brought to America as an infant, he settled with his family in Los Angeles and attended Hollywood High School. His first job in movies was as a production assistant on the 1981 low-budget film, Hell Night (1981), starring Linda Blair.","Birthyear":{"$date":{"$numberLong":"-336614400000"}}},"ImageURL":"https://www.imdb.com/title/tt0120689/mediaviewer/rm946247936/?ref_=tt_ov_i","Stars":"Tom Hanks, Michael Clarke Duncan, David Morse","Featured":"False","Genres":{"Name":"Crime","Description":"Crime fiction, detective story, murder mystery, mystery novel, and police novel are terms used to describe narratives that centre on criminal acts and especially on the investigation, either by an amateur or a professional detective, of a crime, often a murder."}}
{"_id":{"$oid":"6526c204fd6624ad8155ec9b"},"Title":"The Pianist","Description":"A Polish Jewish musician struggles to survive the destruction of the Warsaw ghetto of World War II.","Year":"2002","ImageURL":"https://www.imdb.com/title/tt0120689/mediaviewer/rm946247936/?ref_=tt_ov_i","Stars":"Adrien Brody,Thomas Kretschmann, Frank Finlay","Genres":{"Name":"Biography","Description":"A biography is a nonfiction account of a real person's life written by someone else. Biographies may offer detailed accounts on people's lives, specific important experiences, the historical impact of someone, and more."},"Director":{"Name":"Roman Polanski","Bio":"Raymond Roman Thierry Polański is a French and Polish film director, producer, screenwriter, and actor. He is the recipient of numerous accolades, including an Academy Award, two British Academy Film Awards.","Birthyear":{"$date":{"$numberLong":"-1147824000000"}}},"Featured":"False"}
{"_id":{"$oid":"6526c320fd6624ad8155ec9c"},"Title":"Gladiator","Description":"A former Roman General sets out to exact vengeance against the corrupt emperor who murdered his family and sent him into slavery.","Year":"2000","ImageURL":"https://www.imdb.com/title/tt0172495/mediaviewer/rm2442542592/?ref_=tt_ov_i","Stars":"Russell Crowe, Joaquin Phoenix, Connie Nielsen","Genres":{"Name":"Action","Description":"Action film is a film genre in which the protagonist is thrust into a series of events that typically involve violence and physical feats."},"Director":{"Name":"Ridley Scott","Bio":"Sir Ridley Scott is an English filmmaker. He is best known for directing films in the science fiction, crime, and historical drama genres. His work is known for its atmospheric and highly concentrated visual style.","Birthyear":{"$date":{"$numberLong":"-1012608000000"}}},"Featured":"False"}
{"_id":{"$oid":"6526c3e0fd6624ad8155ec9d"},"Title":"A Separation","Description":"A married couple are faced with a difficult decision - to improve the life of their child by moving to another country or to stay in Iran and look after a deteriorating parent who has Alzheimer's disease.","Year":"2011","ImageURL":"https://www.imdb.com/title/tt1832382/mediaviewer/rm1048720128/?ref_=tt_ov_i","Stars":"Payman Maadi, Leila Hatami, Sareh Bayat","Genres":{"Name":"Drama","Description":"In film and television, drama is a category or genre of narrative fiction (or semi-fiction) intended to be more serious than humorous in tone."},"Director":{"Name":"Asghar Farhadi","Bio":"Asghar Farhadi is an Iranian film director and screenwriter. He is considered one of the most prominent filmmakers of Iranian cinema as well as world cinema in 21st century.","Birthyear":{"$date":"1972-05-07T00:00:00Z"}},"Featured":"False"}
{"_id":{"$oid":"6526c49afd6624ad8155ec9e"},"Title":"Fight Club","Description":"An insomniac office worker and a devil-may-care soap maker form an underground fight club that evolves into much more.","Year":"1999","ImageURL":"https://www.imdb.com/title/tt0137523/mediaviewer/rm1768506368/?ref_=tt_ov_i","Stars":"Brad Pitt, Edward Norton, Meat loaf","Genres":{"Name":"Drama","Description":"In film and television, drama is a category or genre of narrative fiction (or semi-fiction) intended to be more serious than humorous in tone."},"Director":{"Name":"David Fincher","Bio":"David Andrew Leo Fincher is an American filmmaker. His films, most of which are psychological thrillers, have collectively grossed over $2.1 billion worldwide and have received 40 Academy Award nominations; this includes three Best Director nominations for him.","Birthyear":{"$date":{"$numberLong":"-231811200000"}}},"Featured":"False"}
